controllers/OrdersController.php

SELECT orders.*,orders.orderID AS id FROM `orders` 
        LEFT OUTER JOIN payment 
        ON orders.orderID = payment.orderID 
        WHERE CURTIME() > DATE_ADD(dateBooking,INTERVAL 1 DAY) AND status='0';
---
    public function actionCheckorder()
    {
        $sql = "SELECT orders.*,orders.orderID AS id FROM `orders`
        LEFT OUTER JOIN payment
        ON orders.orderID = payment.orderID
        WHERE CURTIME() > DATE_ADD(dateBooking,INTERVAL 1 DAY) AND status='0'; ";

        $params = [];
        $order = new Orders();

        $kw = Yii::$app->db->createCommand($sql, $params)->queryAll();

        $countCHK = count($kw);

        if($kw!==NULL){
            for($i=0; $i<count($kw); $i++){
                $order->orderID = $kw[$i]['orderID'];