models/User.php

    public static function findIdentity($id)
    {
        return static::findOne(['userID'=>$id]);
---
SELECT * FROM `user` WHERE `userID`=4